#include <iostream>
#include <windows.h>
using namespace std;
// місце оголошення глобальних змінних
// Перестановка за допомогою вказівників
void обмін_вказівниками(int *перший, int* другий)
{
	int тимчасовий = *перший;
	*перший = *другий;
	*другий = тимчасовий;
	return;
}
/* --------------------------------------- */
// Перестановка за допомогою лінків
void обмін_лінками(int& перший, int& другий)
{
	int тимчасовий = перший;
	перший = другий;
	другий = тимчасовий;
}
/* --------------------------------------- */
// Перестановка за допомогою значень
void обмін_значеннями(int перший, int другий)
{
	int тимчасовий = перший;
	перший = другий;
	другий = тимчасовий;
}
/* --------------------------------------- */
int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	int x = 255, y = 511;
	cout << "Спроба обміну за значеннями:\n";
	cout << "x = " << x << " y = " << y << "\n";
	обмін_значеннями(x, y);
	cout << "x = " << x << " y = " << y << "\n";
	cout << "Адреси змінних:\n";
	cout << "x = " << &x << " y = " << &y << "\n";
	/* --------------------------------------- */
	cout << "Обмін за вказівниками:\n";
	cout << "x = " << x << " y = " << y << "\n";
	обмін_вказівниками(&x, &y);
	cout << "x = " << x << " y = " << y << "\n";
	cout << " ------------------------------------- " << "\n";
	cout << "Обмін за посиланнями:\n";
	cout << "x = " << x << " y = " << y << "\n";
	обмін_лінками(x, y);
	cout << "x = " << x << " y = " << y << "\n";
	cout << " ------------------------------------- " << "\n";
	
}
